# vim: syntax=ruby filetype=ruby

# rcm: dotfile management
brew "rcm"

tap "gabebw/formulae"
# sed for HTML: https://github.com/gabebw/candle
brew "candle"

brew "heroku"

brew "bat"
brew "chrome-cli"
brew "fd"
brew "fzf"
brew "git"
brew "hexyl"
brew "gh"
brew "pgrep"
brew "ripgrep"
brew "tag"
brew "tree"
brew "vim"
brew "git-delta"

# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew "jq"

# sed for xml: http://xmlstar.sourceforge.net/doc/UG/ch04.html#idm47989546279904
brew "xmlstarlet"

# Slice and dice your CSV
brew "xsv"

# macOS ships with version 2.8. Get version 3.4+ so `diff --color` works.
brew "diffutils"

# so :Rtags works
brew "ctags"

brew "ffmpeg"

# I love `sponge` so much.
brew "moreutils"

# general version manager (and more)
# https://mise.jdx.dev
brew "mise"

# Simple graphs with `bin/line_graph`
brew "gnuplot"

# Personal manpages, written in Markdown
brew "um"

# Rust
# Don't install `rust` - let rustup handle it
brew "rustup"

# watch COMMAND runs COMMAND on a regular cadence
brew "watch"

# Prompt: https://starship.rs
brew "starship"

# Git Large File Support
brew "git-lfs"

# Neovim/Lua
brew "neovim"
brew "stylua"
brew "lua-language-server"

brew "fish"
brew "uv"
brew "prettierd" # prettier daemon to avoid per-format startup cost
brew "eza"
brew "difftastic"
brew "expect" # for `unbuffer`
brew "openssl@3"
brew "php" # for Alfred workflow

# For Scala
brew "scala"
brew "coursier"
