# vim: syntax=ruby filetype=ruby

tap "gabebw/formulae"
# sed for HTML: https://github.com/gabebw/candle
brew "candle"

brew "bat"
brew "chars"
brew "chrome-cli"
brew "ctags" # so :Rtags works
brew "difftastic"
brew "diffutils" # macOS ships with version 2.8. Get version 3.4+ so `diff --color` works.
brew "expect" # for `unbuffer`
brew "eza"
brew "f2" # batch rename: https://github.com/ayoisaiah/f2
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnuplot" # Simple graphs with `bin/line_graph`
brew "gum" # Fancy shell scripting: https://github.com/charmbracelet/gum
brew "heroku"
brew "hexyl"
brew "jq" # sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew "lazygit"
brew "mise" # general version manager (and more) @ https://mise.jdx.dev
brew "moreutils" # I love `sponge` so much.
brew "openssl@3"
brew "pandoc"
brew "pgrep"
brew "php" # for Alfred workflow
brew "pkg-config" # Required for random things, like node-gyp: https://github.com/Automattic/node-canvas/issues/2158
brew "prettierd" # prettier daemon to avoid per-format startup cost
brew "rcm" # rcm: dotfile management
brew "ripgrep"
brew "rustup" # Don't install `rust` - let rustup handle it
brew "sd" # search and replace: https://github.com/chmln/sd
brew "starship" # Prompt: https://starship.rs
brew "tag"
brew "tree"
brew "um" # Personal manpages, written in Markdown
brew "uv"
brew "viddy" # a better `watch`: https://github.com/sachaos/viddy
brew "vim"
brew "watch" # watch COMMAND runs COMMAND on a regular cadence
brew "xmlstarlet" # sed for xml: http://xmlstar.sourceforge.net/doc/UG/ch04.html#idm47989546279904
brew "xsv" # Slice and dice your CSV
brew "zoxide"

# Neovim/Lua
brew "lua-language-server"
brew "luarocks"
brew "neovim"
brew "stylua"

# Scala/Play
brew "coursier"
brew "scala"
brew "sql-formatter"
