# vim: syntax=ruby filetype=ruby

# Install things from the Mac App Store. To get a list of your current apps:
# `mas list`.
brew "mas"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Divvy", id: 413857545
mas "Fantastical", id: 975937182
mas "Instapaper", id: 1481302432
mas "Monosnap", id: 540348655
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696

tap "thoughtbot/formulae"
# rcm: dotfile management
brew "rcm"
# parity: useful tools for Heroku development/staging/production
brew "parity"

# Lets us do `brew services restart postgres`, etc
tap "homebrew/services"

# https://unused.codes/
tap "joshuaclayton/formulae"
brew "unused"

tap "gabebw/formulae"
# sed for HTML: https://github.com/gabebw/candle
brew "candle"

brew "bat"
brew "fzf"
brew "git"
brew "heroku"
brew "hub"
brew "pgrep"
brew "ripgrep"
brew "tree"
brew "vim"
brew "hexyl"

# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew "jq"

# sed for xml: http://xmlstar.sourceforge.net/doc/UG/ch04.html#idm47989546279904
brew "xmlstarlet"

# Slice and dice your CSV
brew "xsv"

# macOS ships with version 2.8. Get version 3.4+ so `diff --color` works.
brew "diffutils"

# so :Rtags works
brew "ctags"

brew "youtube-dl"
# youtube-dl uses ffmpeg to automatically fix some issues in downloaded files
brew "ffmpeg"

# I love `sponge` so much.
brew "moreutils"

# a Postgres pager
brew "pspg"

# asdf version manager: https://github.com/asdf-vm/asdf
brew "asdf"

# Simple graphs with `bin/line_graph`
brew "gnuplot"

# Personal manpages, written in Markdown
brew "sinclairtarget/wst/um"

# Rust
brew "rustup-init"

brew "zsh-syntax-highlighting"
