MS-vsliveshare.vsliveshare
asvetliakov.vscode-neovim
benspaulding.procfile
charliermarsh.ruff
csstools.postcss
dbaeumer.vscode-eslint
dotjoshjohnson.xml
dracula-theme.theme-dracula
dunstontc.viml
eamodio.gitlens
github.vscode-pull-request-github
gitlab.gitlab-workflow
mikestead.dotenv
ms-python.python
ms-python.vscode-pylance
orta.vscode-jest
patbenatar.advanced-new-file
prettier.prettier-vscode
prisma.prisma
rust-lang.rust-analyzer
shopify.ruby-lsp
tamasfe.even-better-toml
testdouble.vscode-standard-ruby
timonwong.shellcheck
usernamehw.errorlens
vscode-icons-team.vscode-icons
