arcanis.vscode-zipfs
asvetliakov.vscode-neovim
benspaulding.procfile
castwide.solargraph
charliermarsh.ruff
csstools.postcss
dbaeumer.vscode-eslint
dotjoshjohnson.xml
dracula-theme.theme-dracula
dunstontc.viml
eamodio.gitlens
esbenp.prettier-vscode
gamunu.vscode-yarn
gerane.theme-tomorrownightbright
gerane.theme-tomorrownighteighties
github.vscode-pull-request-github
gitlab.gitlab-workflow
mbessey.vscode-rufo
mike-co.import-sorter
mikestead.dotenv
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.live-server
orta.vscode-jest
patbenatar.advanced-new-file
prisma.prisma
rust-lang.rust-analyzer
shopify.ruby-lsp
statiolake.vscode-rustfmt
streetsidesoftware.code-spell-checker
sysoev.language-stylus
tamasfe.even-better-toml
testdouble.vscode-standard-ruby
thadeu.vscode-run-rspec-file
theaflowers.witch-hazel
thisismanta.stylus-supremacy
timonwong.shellcheck
usernamehw.errorlens
vadimcn.vscode-lldb
vscode-icons-team.vscode-icons
wingrunr21.vscode-ruby
